{
  "berry": [
    [
      "Many people enjoy picking fresh berries like strawberries and blueberries in the countryside during summer.",
      "许多人喜欢在夏天去乡下采摘草莓和蓝莓等新鲜浆果。"
    ],
    [
      "The berry season usually starts in late spring and lasts until early autumn.",
      "浆果季通常从春末开始，一直持续到初秋。"
    ],
    [
      "This berry smoothie is not only delicious but also rich in vitamins and antioxidants.",
      "这款浆果奶昔不仅美味，还富含维生素和抗氧化剂。"
    ],
    [
      "The small, red berry on that bush is actually poisonous and should not be eaten.",
      "那丛灌木上的小红浆果实际上是有毒的，不能食用。"
    ],
    [
      "She decorated the cake with various berries, making it look extremely appealing.",
      "她用各种浆果装饰蛋糕，让它看起来极具吸引力。"
    ]
  ],
  "arrears": [
    [
      "The company is struggling to pay off its arrears due to the recent economic downturn.",
      "由于近期经济衰退，该公司正努力偿还欠款。"
    ],
    [
      "He fell into arrears with his rent after losing his job last month.",
      "上个月失业后，他拖欠了房租。"
    ],
    [
      "The utility provider sent a notice about the arrears in the electricity bill.",
      "公用事业供应商发出了一份关于电费欠费的通知。"
    ],
    [
      "The athlete had to make up for the arrears in training after recovering from an injury.",
      "这位运动员受伤康复后不得不弥补训练上落下的进度。"
    ],
    [
      "The government is taking measures to collect the tax arrears from delinquent taxpayers.",
      "政府正在采取措施向拖欠税款的纳税人追缴欠款。"
    ]
  ],
  "comptroller": [
    [
      "The comptroller is responsible for overseeing the financial records and ensuring compliance with regulations.",
      "主计长负责监督财务记录并确保遵守相关规定。"
    ],
    [
      "Our company's comptroller presented a detailed budget report at the monthly meeting.",
      "我们公司的主计长在月度会议上提交了一份详细的预算报告。"
    ],
    [
      "The comptroller detected a minor error in the accounting system and quickly resolved it.",
      "主计长发现了会计系统中的一个小错误，并迅速解决了它。"
    ],
    [
      "As the comptroller, she has the authority to approve or reject certain financial transactions.",
      "作为主计长，她有权批准或拒绝某些财务交易。"
    ],
    [
      "The city's comptroller is working on a plan to reduce unnecessary government spending.",
      "该市的主计长正在制定一项减少政府不必要开支的计划。"
    ]
  ],
  "canterbury": [
    [
      "Canterbury Cathedral, a magnificent religious structure, attracts numerous tourists from around the world every year.",
      "坎特伯雷大教堂是一座宏伟的宗教建筑，每年都吸引着来自世界各地的众多游客。"
    ],
    [
      "Many pilgrims in the past set off on arduous journeys to reach Canterbury to seek spiritual solace.",
      "过去，许多朝圣者踏上艰辛的旅程前往坎特伯雷寻求心灵慰藉。"
    ],
    [
      "The Canterbury Tales, written by Geoffrey Chaucer, is a classic of English literature.",
      "杰弗里·乔叟所著的《坎特伯雷故事集》是英国文学的经典之作。"
    ],
    [
      "Canterbury is renowned for its rich history and well - preserved medieval architecture.",
      "坎特伯雷以其丰富的历史和保存完好的中世纪建筑而闻名。"
    ],
    [
      "Visiting Canterbury gives you a chance to step back in time and experience the charm of old England.",
      "游览坎特伯雷让你有机会回到过去，感受古老英格兰的魅力。"
    ]
  ],
  "bookmaker": [
    [
      "A professional bookmaker carefully assesses the odds of different sports events to ensure profitability.",
      "专业博彩公司会仔细评估不同体育赛事的赔率以确保盈利。"
    ],
    [
      "The bookmaker adjusted the betting lines after getting new information about the players' injuries.",
      "博彩公司在获得球员受伤的新消息后调整了投注赔率。"
    ],
    [
      "Many bettors rely on the bookmaker's analysis to make their wagers on horse - racing.",
      "许多赌徒依靠博彩公司的分析来进行赛马投注。"
    ],
    [
      "The bookmaker offers a variety of betting options for customers interested in football matches.",
      "博彩公司为对足球比赛感兴趣的客户提供了多种投注选择。"
    ],
    [
      "A good bookmaker keeps a close eye on market trends and public sentiment to set accurate odds.",
      "优秀的博彩公司会密切关注市场趋势和公众情绪以设定准确的赔率。"
    ]
  ],
  "cantor": [
    [
      "The cantor led the congregation in a beautiful hymn, his voice resonating through the church.",
      "领唱者带领会众唱起一首优美的赞美诗，他的声音在教堂里回荡。"
    ],
    [
      "Cantor Smith has been serving at this synagogue for over a decade, with great devotion.",
      "领唱者史密斯已经怀着极大的热忱在这座犹太教堂服务了十多年。"
    ],
    [
      "During the religious ceremony, the cantor's intonation added a solemn and sacred atmosphere.",
      "在宗教仪式中，领唱者的语调增添了庄严神圣的氛围。"
    ],
    [
      "The young cantor is learning to master different musical styles for various religious events.",
      "这位年轻的领唱者正在学习掌握不同的音乐风格，以适应各种宗教活动。"
    ],
    [
      "People gathered around to listen to the cantor, who was known for his powerful and moving performance.",
      "人们围拢过来听这位以强劲动人的表演而闻名的领唱者演唱。"
    ]
  ],
  "deluge": [
    [
      "The city was hit by a deluge last night, causing widespread flooding in many low - lying areas.",
      "昨晚这座城市遭遇了一场暴雨，导致许多低洼地区大面积被淹。"
    ],
    [
      "After the product launch, the company received a deluge of orders from customers all over the world.",
      "产品发布后，该公司收到了来自世界各地客户的大量订单。"
    ],
    [
      "A deluge of emails flooded his inbox after he posted the controversial article online.",
      "他在网上发布了那篇有争议的文章后，大量邮件涌入了他的收件箱。"
    ],
    [
      "The sudden deluge caught the hikers off guard, and they had to seek shelter quickly.",
      "突如其来的暴雨让徒步旅行者们措手不及，他们不得不迅速寻找避难处。"
    ],
    [
      "The media's deluge of criticism forced the politician to make a public apology.",
      "媒体铺天盖地的批评迫使这位政客公开道歉。"
    ]
  ],
  "counteract": [
    [
      "Doctors often prescribe certain medications to counteract the side - effects of more powerful drugs.",
      "医生通常会开一些特定的药物来抵消强效药物的副作用。"
    ],
    [
      "To counteract the negative impact of stress, many people choose to practice yoga regularly.",
      "为了抵消压力的负面影响，许多人选择定期练习瑜伽。"
    ],
    [
      "Adding lemon juice can counteract the bitterness in this drink and make it more palatable.",
      "加入柠檬汁可以中和这种饮料的苦味，使其更可口。"
    ],
    [
      "The government has launched new policies to counteract the economic downturn and stimulate growth.",
      "政府出台了新政策来应对经济衰退并刺激增长。"
    ],
    [
      "Taking vitamin C can help counteract the harmful effects of free radicals in the body.",
      "服用维生素C有助于抵消体内自由基的有害影响。"
    ]
  ],
  "disavow": [
    [
      "The politician was forced to disavow the controversial statement he made during the campaign to avoid losing more votes.",
      "这位政治家被迫否认他在竞选期间发表的有争议的言论，以免失去更多选票。"
    ],
    [
      "The company decided to disavow any connection with the unethical supplier to protect its reputation in the market.",
      "该公司决定否认与这家不道德的供应商有任何关联，以维护其在市场上的声誉。"
    ],
    [
      "She chose to disavow her former beliefs after experiencing a series of life - changing events.",
      "在经历了一系列改变人生的事件后，她选择放弃自己以前的信仰。"
    ],
    [
      "The athlete's agent quickly disavowed the rumors about his client's drug use, stating they were baseless.",
      "这位运动员的经纪人迅速否认了有关他客户使用兴奋剂的谣言，称这些谣言毫无根据。"
    ],
    [
      "The author had to disavow the unauthorized translation of his book to ensure its original integrity and quality.",
      "这位作者不得不否认那本未经授权的书籍译本，以确保原著的完整性和质量。"
    ]
  ],
  "emanate": [
    [
      "The sweet fragrance seems to emanate from the flowers in the corner of the room.",
      "那股甜美的香气似乎是从房间角落里的花散发出来的。"
    ],
    [
      "All the problems emanate from a lack of communication within the team.",
      "所有问题都源于团队内部缺乏沟通。"
    ],
    [
      "Positive energy seems to emanate from her whenever she enters the room.",
      "每当她走进房间，似乎都会散发出正能量。"
    ],
    [
      "The sound of laughter emanated from the living - room, indicating that everyone was having a great time.",
      "客厅里传出阵阵笑声，表明大家都玩得很开心。"
    ],
    [
      "The power to make decisions should not solely emanate from the top management but also involve employees at all levels.",
      "做决策的权力不应仅仅来自高层管理人员，还应让各级员工参与其中。"
    ]
  ],
  "dredge": [
    [
      "They plan to dredge the river to improve its water flow and prevent flooding.",
      "他们计划疏浚这条河流，以改善水流并防止洪水泛滥。"
    ],
    [
      "The detective tried to dredge up old memories to solve the long - standing case.",
      "侦探试图唤起旧记忆来侦破这起悬案。"
    ],
    [
      "The company will dredge the harbor to make it deeper for larger ships.",
      "该公司将对港口进行疏浚，使其更深，以便大型船只通行。"
    ],
    [
      "She had to dredge through a pile of documents to find the important contract.",
      "她不得不翻遍一堆文件来找到那份重要的合同。"
    ],
    [
      "The journalist tried to dredge out some new information from the reluctant witness.",
      "记者试图从这位不情愿的证人那里挖掘出一些新信息。"
    ]
  ],
  "embodiment": [
    [
      "The new building is the embodiment of modern architecture, combining functionality with aesthetic appeal.",
      "这座新建筑是现代建筑的典范，将功能性与美学吸引力融为一体。"
    ],
    [
      "The athlete's dedication and hard work make him the embodiment of the spirit of sportsmanship.",
      "这位运动员的奉献和努力使他成为体育精神的化身。"
    ],
    [
      "Her kindness and generosity are the embodiment of what it means to be a good neighbor.",
      "她的善良和慷慨体现了好邻居的真正含义。"
    ],
    [
      "The company's latest product is the embodiment of innovation, offering features never seen before.",
      "该公司的最新产品是创新的体现，具备前所未有的功能。"
    ],
    [
      "The character in the novel is the embodiment of the struggles and hopes of the common people.",
      "小说中的这个人物是普通人奋斗与希望的化身。"
    ]
  ],
  "erotic": [
    [
      "The movie contains some erotic scenes that are not suitable for minors.",
      "这部电影包含一些不适合未成年人观看的色情场景。"
    ],
    [
      "The artist's paintings often explore erotic themes in a subtle way.",
      "这位艺术家的画作常常以含蓄的方式探索色情主题。"
    ],
    [
      "The novel describes an erotic relationship between the two main characters.",
      "这部小说描述了两位主人公之间的一段艳情关系。"
    ],
    [
      "The poem uses vivid language to create an erotic atmosphere.",
      "这首诗用生动的语言营造出一种色情的氛围。"
    ],
    [
      "Some people find certain types of music to have an erotic allure.",
      "有些人觉得某些类型的音乐具有一种情欲的魅力。"
    ]
  ],
  "esoteric": [
    [
      "The professor's lecture on an esoteric branch of physics left most students bewildered.",
      "教授关于物理学一个深奥分支的讲座让大多数学生感到困惑。"
    ],
    [
      "He has a deep interest in esoteric knowledge such as ancient alchemical practices.",
      "他对诸如古代炼金术之类的深奥知识有着浓厚的兴趣。"
    ],
    [
      "This esoteric symbol in the old manuscript is yet to be decoded by scholars.",
      "古手稿中的这个深奥符号尚未被学者们破译。"
    ],
    [
      "The book delves into esoteric aspects of mythology that are rarely discussed.",
      "这本书深入探讨了神话中很少被提及的深奥方面。"
    ],
    [
      "Only a few experts in the field can understand these esoteric mathematical formulas.",
      "只有该领域的少数专家能理解这些深奥的数学公式。"
    ]
  ],
  "extrapolate": [
    [
      "Scientists often extrapolate future climate trends based on current data and historical patterns.",
      "科学家们经常根据当前数据和历史模式来推断未来的气候趋势。"
    ],
    [
      "You can't just extrapolate the results from this small sample to the entire population.",
      "你不能仅仅根据这个小样本的结果就推断出整个人口的情况。"
    ],
    [
      "The economist tried to extrapolate the potential economic growth from the latest market indicators.",
      "这位经济学家试图根据最新的市场指标推断出潜在的经济增长情况。"
    ],
    [
      "It's risky to extrapolate the company's long - term success from its short - term profits.",
      "仅从公司的短期利润来推断其长期的成功是有风险的。"
    ],
    [
      "The analyst extrapolated the sales volume for the next quarter by analyzing the previous sales records.",
      "分析师通过分析以往的销售记录推断出下个季度的销售量。"
    ]
  ],
  "factional": [
    [
      "The factional disputes within the political party are causing significant setbacks in policy - making.",
      "该政党内部的派系争端正在给政策制定造成重大挫折。"
    ],
    [
      "Factional loyalties often lead to a lack of unity and cooperation in large organizations.",
      "在大型组织中，对派系的忠诚常常导致缺乏团结与合作。"
    ],
    [
      "The company's factional groups are competing for resources, which affects overall efficiency.",
      "公司的各个派系团体正在争夺资源，这影响了整体效率。"
    ],
    [
      "Factional rivalries in the community have made it difficult to reach a consensus on important issues.",
      "社区内的派系竞争使得在重要问题上达成共识变得困难。"
    ],
    [
      "The factional strife in the club has divided its members and damaged its reputation.",
      "俱乐部里的派系斗争使成员们产生了分歧，也损害了俱乐部的声誉。"
    ]
  ],
  "geothermal": [
    [
      "Geothermal energy is a sustainable power source that harnesses the heat from the Earth's interior for various applications.",
      "地热能是一种可持续的能源，它利用地球内部的热量用于各种用途。"
    ],
    [
      "Many countries are increasingly investing in geothermal projects to reduce their reliance on fossil fuels.",
      "许多国家正越来越多地投资地热能项目，以减少对化石燃料的依赖。"
    ],
    [
      "The geothermal power plant efficiently converts the natural heat into electricity, benefiting the local community.",
      "地热发电厂有效地将自然热能转化为电能，造福了当地社区。"
    ],
    [
      "Scientists are exploring new methods to enhance the extraction of geothermal resources in a more environmentally - friendly way.",
      "科学家们正在探索新方法，以更环保的方式加强对地热资源的开采。"
    ],
    [
      "Geothermal heating systems can provide a stable and cost - effective way to warm buildings during cold seasons.",
      "地热供暖系统可以在寒冷季节为建筑物提供一种稳定且经济高效的取暖方式。"
    ]
  ],
  "giddy": [
    [
      "After spinning around quickly, he felt giddy and had to sit down for a while to regain his balance.",
      "快速旋转后，他感到头晕目眩，不得不坐下来一会儿以恢复平衡。"
    ],
    [
      "The young couple was in a giddy state of excitement as they planned their dream wedding.",
      "这对年轻情侣在筹划他们梦想中的婚礼时，处于一种极度兴奋的状态。"
    ],
    [
      "Looking down from the top of the tall building made her feel giddy and she quickly stepped back from the edge.",
      "从高楼顶部往下看让她感到头晕，她赶紧从边缘往后退。"
    ],
    [
      "The stock market's sudden rise put investors in a giddy mood, hoping for even greater profits.",
      "股市的突然上涨让投资者们心情雀跃，期望能获得更高的利润。"
    ],
    [
      "The giddy laughter of the children filled the playground, creating a lively and joyful atmosphere.",
      "孩子们欢快的笑声充满了操场，营造出一种活泼欢快的氛围。"
    ]
  ],
  "greeting": [
    [
      "A warm greeting from a friend can instantly brighten up your day.",
      "朋友的热情问候能立刻让你一整天都心情愉悦。"
    ],
    [
      "In some cultures, a handshake is a common greeting when meeting someone for the first time.",
      "在一些文化中，初次见面时握手是一种常见的问候方式。"
    ],
    [
      "She sent a greeting card to her grandparents on their anniversary.",
      "她在祖父母结婚纪念日时给他们寄了一张贺卡。"
    ],
    [
      "The host's greeting at the party was so sincere that everyone felt welcome.",
      "派对上主人的问候非常真诚，让每个人都有宾至如归的感觉。"
    ],
    [
      "His simple greeting carried a lot of warmth and kindness.",
      "他简单的问候中饱含着许多温暖与善意。"
    ]
  ],
  "harp": [
    [
      "She played a beautiful melody on the harp at the concert last night, captivating the audience.",
      "她昨晚在音乐会上用竖琴演奏了一首美妙的旋律，吸引了观众。"
    ],
    [
      "My grandmother always used to harp on the importance of good manners whenever we visited her.",
      "每当我们去看望祖母时，她总是唠叨着强调礼貌的重要性。"
    ],
    [
      "The antique harp in the museum is a rare and valuable piece of musical history.",
      "博物馆里的那架古董竖琴是音乐史上一件稀有而珍贵的物品。"
    ],
    [
      "He decided to take up the harp as a hobby, hoping to master this elegant instrument.",
      "他决定把弹奏竖琴作为一种爱好，希望能掌握这一优雅的乐器。"
    ],
    [
      "Don't harp on about your past mistakes; instead, focus on making better choices in the future.",
      "别再喋喋不休地谈论你过去的错误了，而是要专注于未来做出更好的选择。"
    ]
  ],
  "hunch": [
    [
      "I have a hunch that our team will win the game this weekend, though there's no solid evidence yet.",
      "我预感我们队本周末会赢得比赛，尽管目前还没有确凿的证据。"
    ],
    [
      "She followed her hunch and invested in that small startup, and now she's reaping huge rewards.",
      "她凭直觉投资了那家小初创公司，现在正收获丰厚的回报。"
    ],
    [
      "My hunch about the new neighbor turned out to be right; he's actually a very friendly and helpful person.",
      "我对新邻居的直觉是对的；他实际上是个非常友好且乐于助人的人。"
    ],
    [
      "Despite lacking data, his hunch led him to propose a bold new marketing strategy.",
      "尽管缺乏数据支持，他的直觉还是促使他提出了一个大胆的新营销策略。"
    ],
    [
      "I got a hunch that something was wrong when I saw the worried look on his face.",
      "当我看到他脸上担忧的神情时，我直觉感到出问题了。"
    ]
  ],
  "hypocritical": [
    [
      "It's hypocritical of him to preach about honesty while constantly lying himself.",
      "他自己老是说谎，却宣扬诚实，真是虚伪。"
    ],
    [
      "She thought it was hypocritical for people to praise the event when they didn't really support it.",
      "她觉得人们并不真正支持这个活动却还加以赞扬，很虚伪。"
    ],
    [
      "The politician's hypocritical remarks made the public lose trust in him.",
      "这位政客虚伪的言论让公众对他失去了信任。"
    ],
    [
      "It seems hypocritical that they claim to care about the environment but still use a lot of plastic.",
      "他们声称关心环境，但仍然大量使用塑料制品，这似乎很虚伪。"
    ],
    [
      "He gave a hypocritical apology, not really meaning what he said.",
      "他做了一个虚伪的道歉，并非真心实意。"
    ]
  ],
  "intentioned": [
    [
      "The email he sent was not what he intended, as there was a misunderstanding in the draft.",
      "他发出的那封邮件并非他本意，因为草稿中存在误解。"
    ],
    [
      "The new policy is intended to reduce the environmental impact of industrial activities.",
      "新政策旨在减少工业活动对环境的影响。"
    ],
    [
      "The gift she bought was intended for her best friend's birthday.",
      "她买的这份礼物是打算送给她最好朋友过生日用的。"
    ],
    [
      "The speech was intended to inspire the audience and encourage them to take action.",
      "这场演讲意在激励听众并鼓励他们采取行动。"
    ],
    [
      "The changes in the schedule were not what we intended, but we have to adapt.",
      "日程安排的变动并非我们本意，但我们必须适应。"
    ]
  ],
  "luminary": [
    [
      "The literary luminary gave a fascinating talk about his latest novel at the book fair.",
      "这位文学巨匠在书展上就他的最新小说发表了一场精彩的演讲。"
    ],
    [
      "As a scientific luminary, she has made significant contributions to the field of genetics.",
      "作为一位科学泰斗，她在遗传学领域做出了重大贡献。"
    ],
    [
      "The business luminary shared his secrets of success with the young entrepreneurs at the seminar.",
      "这位商业巨擘在研讨会上与年轻的企业家们分享了他的成功秘诀。"
    ],
    [
      "Many students were eager to attend the lecture by the well - known luminary in the art world.",
      "许多学生都渴望参加这位艺术界知名大师的讲座。"
    ],
    [
      "The city honored the local luminary for his long - term service to the community.",
      "该市表彰了这位当地杰出人物为社区所做的长期贡献。"
    ]
  ],
  "lignite": [
    [
      "Lignite is a type of coal with relatively low carbon content and high moisture, often used in power generation.",
      "褐煤是一种含碳量相对较低、含水量较高的煤炭，常用于发电。"
    ],
    [
      "The lignite mines in this region have been a significant source of energy for local industries for decades.",
      "几十年来，该地区的褐煤矿一直是当地工业的重要能源来源。"
    ],
    [
      "Due to its low energy density, lignite needs to be mined in large quantities to meet energy demands.",
      "由于褐煤能量密度低，需要大量开采才能满足能源需求。"
    ],
    [
      "The combustion of lignite releases more pollutants compared to other types of coal, which raises environmental concerns.",
      "与其他类型的煤炭相比，褐煤燃烧会释放更多污染物，这引发了环境问题。"
    ],
    [
      "Scientists are researching new technologies to improve the efficiency of lignite utilization and reduce its environmental impact.",
      "科学家们正在研究新技术，以提高褐煤的利用效率并减少其对环境的影响。"
    ]
  ],
  "patently": [
    [
      "The claim that the product can cure all diseases is patently false and no one should believe it.",
      "声称该产品能包治百病显然是假的，没人应该相信。"
    ],
    [
      "His attempt to shift the blame onto others was patently a desperate move to avoid punishment.",
      "他试图把责任推给别人，显然是为了逃避惩罚而孤注一掷的举动。"
    ],
    [
      "The report's conclusion is patently based on incomplete data and needs to be re - evaluated.",
      "这份报告的结论显然是基于不完整的数据得出的，需要重新评估。"
    ],
    [
      "It was patently obvious that she had been crying, as her eyes were red and swollen.",
      "很明显她一直在哭，因为她的眼睛又红又肿。"
    ],
    [
      "The new policy is patently unfair to small businesses, who will face more difficulties.",
      "这项新政策显然对小企业不公平，它们将面临更多困难。"
    ]
  ],
  "precarious": [
    [
      "The hiker found himself in a precarious position on the steep cliff, with only a thin branch to hold onto.",
      "徒步旅行者发现自己在陡峭的悬崖上处于危险的境地，只能抓住一根细树枝。"
    ],
    [
      "The company's financial situation is precarious due to the long - term economic downturn and fierce competition.",
      "由于长期的经济低迷和激烈的竞争，该公司的财务状况岌岌可危。"
    ],
    [
      "She made a precarious living by doing odd jobs in the neighborhood, never knowing when the next paycheck would come.",
      "她靠在附近打零工维持不稳定的生计，永远不知道下一笔收入何时会来。"
    ],
    [
      "The precarious balance of power in the region could easily be disrupted by any small conflict.",
      "该地区脆弱的权力平衡很容易被任何小冲突打破。"
    ],
    [
      "Balancing a large tray of drinks on one hand while walking through a crowded room is a precarious task.",
      "一手端着一大盘饮料在拥挤的房间里行走是一项危险的任务。"
    ]
  ],
  "reconnaissance": [
    [
      "The military conducted a reconnaissance mission to gather intelligence about the enemy's positions.",
      "军方执行了一次侦察任务，以收集敌军阵地的情报。"
    ],
    [
      "Before starting the construction project, a detailed reconnaissance of the site was carried out to assess its suitability.",
      "在启动建设项目之前，对场地进行了详细的勘察，以评估其适用性。"
    ],
    [
      "The reconnaissance team used drones to survey the area that was difficult to access on foot.",
      "侦察小组使用无人机对难以徒步进入的区域进行了勘察。"
    ],
    [
      "Pilots often fly reconnaissance flights to monitor the weather conditions and potential hazards in the flight path.",
      "飞行员经常执行侦察飞行任务，以监测天气状况和飞行路线上的潜在危险。"
    ],
    [
      "The police carried out a reconnaissance operation to identify the suspects' hideout before making an arrest.",
      "警方开展了一次侦察行动，在实施抓捕前确定嫌疑人的藏身之处。"
    ]
  ],
  "relegate": [
    [
      "Don't relegate your dreams to the corner; pursue them with determination and passion.",
      "不要把你的梦想搁置在角落里，要带着决心和热情去追求它们。"
    ],
    [
      "The manager decided to relegate the under - performing employee to a less important position.",
      "经理决定把表现不佳的员工调到一个不太重要的岗位。"
    ],
    [
      "The new policy will relegate some traditional industries to a secondary status in the economic structure.",
      "新政策将使一些传统产业在经济结构中处于次要地位。"
    ],
    [
      "In the tournament, the losing team will be relegated to a lower division next season.",
      "在锦标赛中，输的球队下个赛季将被降到低一级的联赛。"
    ],
    [
      "We should not relegate environmental protection to a secondary concern just for the sake of short - term economic gains.",
      "我们不应仅仅为了短期经济利益就把环境保护问题置于次要地位。"
    ]
  ],
  "semblance": [
    [
      "He tried to maintain a semblance of calm, but his trembling hands gave away his nervousness.",
      "他试图保持一副镇定的样子，但颤抖的双手暴露了他的紧张。"
    ],
    [
      "The city managed to keep a semblance of normalcy despite the ongoing construction work.",
      "尽管正在进行建筑施工，这座城市仍设法维持着表面的正常状态。"
    ],
    [
      "After the chaos, there was finally a semblance of order restored in the classroom.",
      "混乱过后，教室里终于恢复了些许秩序。"
    ],
    [
      "She put on a semblance of a smile when she saw her ex - boyfriend, though she felt sad inside.",
      "看到前男友时，她强装出一丝笑容，尽管内心很悲伤。"
    ],
    [
      "The old house still retains a semblance of its former grandeur, despite years of neglect.",
      "尽管多年无人打理，那座老房子仍保留着几分昔日的辉煌。"
    ]
  ],
  "sidestep": [
    [
      "He managed to sidestep the oncoming cyclist at the last moment, avoiding a collision.",
      "他在最后一刻成功避开了迎面而来的自行车骑手，避免了一场碰撞。"
    ],
    [
      "The politician skillfully sidestepped the controversial question during the press conference, giving a vague answer.",
      "这位政治家在新闻发布会上巧妙地回避了那个有争议的问题，给出了一个含糊的答案。"
    ],
    [
      "She had to sidestep a large puddle on the sidewalk to keep her shoes dry.",
      "她不得不绕过人行道上的一个大水坑，以免鞋子弄湿。"
    ],
    [
      "The company tried to sidestep the new regulations by finding a legal loophole.",
      "该公司试图通过找到一个法律漏洞来规避新规定。"
    ],
    [
      "The dancer gracefully sidestepped to the left and then continued with the routine.",
      "舞者优雅地向左迈了一步，然后继续表演常规动作。"
    ]
  ],
  "siren": [
    [
      "The piercing siren of the ambulance echoed through the quiet streets, alerting everyone to the emergency.",
      "救护车尖锐的警报声在安静的街道上回荡，提醒着每个人有紧急情况。"
    ],
    [
      "In Greek mythology, sirens were dangerous creatures whose enchanting songs lured sailors to their doom.",
      "在希腊神话中，塞壬是危险的生物，她们迷人的歌声会引诱水手走向毁灭。"
    ],
    [
      "The police car raced by with its siren blaring, chasing after the suspect's vehicle.",
      "警车鸣着警笛飞驰而过，追赶着嫌疑人的车辆。"
    ],
    [
      "The factory's siren went off at 5 p.m., signaling the end of the workday for the employees.",
      "工厂的汽笛在下午5点响起，宣告着员工工作日的结束。"
    ],
    [
      "The siren's wail grew louder as the fire truck approached the burning building.",
      "随着消防车驶向燃烧的大楼，警报声越来越响。"
    ]
  ],
  "superficial": [
    [
      "His analysis of the problem was superficial, failing to address the root causes.",
      "他对这个问题的分析很肤浅，未能触及根本原因。"
    ],
    [
      "The painting only gives a superficial impression of the beautiful scenery, lacking in-depth details.",
      "这幅画只是对美丽风景有一个表面的呈现，缺乏深入的细节。"
    ],
    [
      "Don't be misled by her superficial charm; she has a strong and independent personality.",
      "别被她表面的魅力误导，她有着坚强独立的个性。"
    ],
    [
      "The report provides a superficial overview of the market situation without in - depth research.",
      "这份报告对市场情况进行了表面的概述，没有深入研究。"
    ],
    [
      "A superficial acquaintance with a language won't help you communicate effectively in real - life situations.",
      "对一门语言仅有肤浅的了解无法帮助你在现实生活中进行有效的交流。"
    ]
  ],
  "steroid": [
    [
      "Some athletes take steroid drugs illegally to enhance their physical performance and gain an unfair advantage in competitions.",
      "一些运动员非法服用类固醇药物来提高身体机能，从而在比赛中获得不公平的优势。"
    ],
    [
      "Doctors may prescribe steroid medications to treat certain inflammatory diseases such as arthritis.",
      "医生可能会开类固醇药物来治疗某些炎症性疾病，如关节炎。"
    ],
    [
      "The body naturally produces steroid hormones that play crucial roles in regulating metabolism and immune responses.",
      "人体自然产生类固醇激素，这些激素在调节新陈代谢和免疫反应方面起着至关重要的作用。"
    ],
    [
      "Steroid creams are often used to relieve skin conditions like eczema and psoriasis.",
      "类固醇乳膏常用于缓解湿疹和牛皮癣等皮肤问题。"
    ],
    [
      "Using steroid supplements without a doctor's advice can lead to serious health risks and side - effects.",
      "在没有医生建议的情况下使用类固醇补充剂会导致严重的健康风险和副作用。"
    ]
  ],
  "trainee": [
    [
      "The trainee is eager to learn new skills to improve his performance in the company.",
      "这位实习生渴望学习新技能，以提升自己在公司的表现。"
    ],
    [
      "As a trainee, she has to follow a strict schedule set by the training program.",
      "作为一名实习生，她必须遵循培训项目制定的严格日程安排。"
    ],
    [
      "The trainee was given a challenging task to test his problem - solving ability.",
      "实习生被分配了一项具有挑战性的任务，以测试他的解决问题能力。"
    ],
    [
      "Our company provides a comprehensive training program for each trainee to ensure their professional growth.",
      "我们公司为每位实习生提供全面的培训项目，以确保他们的职业发展。"
    ],
    [
      "The trainee quickly adapted to the working environment and got along well with colleagues.",
      "这位实习生很快适应了工作环境，并与同事们相处融洽。"
    ]
  ],
  "titanium": [
    [
      "Titanium is widely used in the aerospace industry because of its high strength and low density.",
      "由于钛具有高强度和低密度的特点，它在航空航天工业中被广泛使用。"
    ],
    [
      "The watch features a durable titanium case that can withstand daily wear and tear.",
      "这款手表采用了耐用的钛金属表壳，能经受住日常的磨损。"
    ],
    [
      "Scientists are researching new methods to extract titanium more efficiently from its ores.",
      "科学家们正在研究更有效地从矿石中提取钛的新方法。"
    ],
    [
      "The titanium alloy used in this structure makes it both lightweight and corrosion - resistant.",
      "这种结构中使用的钛合金使其既轻便又耐腐蚀。"
    ],
    [
      "The medical field benefits from titanium implants due to their biocompatibility with human tissues.",
      "由于钛植入物与人体组织具有生物相容性，医疗领域从中受益。"
    ]
  ]
}